const productData = {
    "dog-food-1": {
        name: "高品質成犬狗糧",
        price: "1500",
        weight: "15kg",
        img: "img/02.jpg",
        desc: "專為成犬設計，營養均衡，健康美味。",
        features: [
            "促進腸道菌叢平衡",
            "支持免疫力，維持整體健康",
            "高蛋白配方，維持成犬肌肉健康"
        ],
        discount: 0.8,
       discountEnd: "2026-01-09T23:59:59"

    },
     "dog-food-2": {
        name: "高品質幼犬狗糧",
        price: "800",
        weight: "8kg",
        img: "img/02-1.png",
        desc: "幼犬專用，幫助成長與骨骼發育。",
        features: [
            "促進腸道微生物菌叢維持平衡",
            "添加 DHA，有助幼犬大腦發育",
            "含維生素 E 和維生素 C，幫助消化系統發展"
        ]
    },
    "dog-food-3": {
        name: "狗食乾糧-雞肉及蔬菜口味",
        price: "600",
        weight: "10kg",
        img: "img/02-9.png",
        desc: "專為成犬日常需求設計，營養均衡，幫助維持健康體態與活力",
        features: [
            "提升免疫力，活力充沛",
            "促進腦部發展，營養均衡",
            "含蔬菜與必要維生素礦物質"
        ]
    },
    "dog-food-4": {
        name: "UNCLE PAUL保羅叔叔高級狗糧-雞肉糙米 ",
        price: "950",
        weight: "18kg",
        img: "img/02-10.jpg",
        desc: "嚴選雞肉與糙米配方，提供全犬種每日所需營養，幫助維持健康體態與穩定活力。",
        features: [
            "適合全犬種日常食用",
            "維持骨骼健康與良好體態",
            "雞肉與糙米配方，營養均衡好吸收"
        ]
    },
     "dog-food-5": {
        name: "UNCLE PAUL保羅叔叔高級狗糧-三鮮高蛋白-全齡犬用 ",
        price: "550",
        weight: "3.5kg x 2入組",
        img: "img/02-11.jpg",
        desc: "三種鮮肉來源打造高蛋白配方，提供全齡犬所需能量，支持日常活動與體能表現",
        features: [
            "均衡配方，維持健康體態",
            "適合全齡犬與活動量較高犬隻",
            "高蛋白營養，支持肌肉與體能需求"
        ]
    },
     "dog-toy-1": {
        name: "Non-stop dogwear |繩索咬球",
        price: "500",
        img: "img/02-16.png",
        desc: "繩索咬球升級經典玩球，結合投接與拉扯互動，玩耍更有趣",
        features: [
                "超耐咬設計",
                "細緻防滑紋路，加強抓握穩定度",
                "高識別亮橘配色"
        ]
    },
    "dog-toy-2": {
        name: "【美國DURAFORCE】經典骨頭-藍綠色",
        price: "420",
        img: "img/02-4.png",
        desc: "超級丟拉玩具，耐咬玩具再升級!!!!",
        features: [
                "尼龍結構耐咬耐拉",
                "拉扯、啃咬都能盡情玩",
                "縫線更牢固，不易破損"
        ]
    },
    "dog-toy-3": {
        name: "Non-stop dogwear | 狗狗專用玩球",
        price: "400",
        img: "img/02-14.png",
        desc: "兼具彈性耐咬與牙齦保護，橘黑雙色提升辨識度",
        features: [
                "柔軟材質保護牙齦",
                "優異抓握與飛行彈跳性",
                "不含 BPA、塑化劑、重金屬等有害物質"
        ]
    },
    "dog-toy-4": {
        name: "Non-stop dogwear | 飛盤",
        price: "690",
        img: "img/02-15.png",
        desc: "高品質無毒熱塑橡膠飛盤，彈性佳、耐用，耐咬安全",
        features: [
                "結構穩固，不易變形斷裂",
                "圓邊手感，保護牙齒與口腔",
                "無毒、不含塑化劑或有害化學物"
        ],
        discount: 0.8,
       discountEnd: "2026-01-09T23:59:59"
    },

    "dog-clothes-1": {
        name: "恐龍大學Ｔ狗狗衣服",
        price: "590",
        img: "img/03.png",
        desc: "可愛恐龍造型設計，輕量舒適布料，讓毛孩穿著活動自如，四季皆適合",
        sizes: ["S", "M", "L"]  ,// ✅ 尺寸放在這裡
        features: [
            "透氣舒適，不悶熱",
            "恐龍大學印花，時尚吸睛",
            "符合狗狗活動習慣，穿著自在",
        ]
    },

    "dog-clothes-2": {
        name: "狗狗輕鋒衣",
        price: "550",
        img: "img/02-5.png",
        desc: "輕量防風設計，適合日常散步與換季穿著，舒適又自在",
        sizes: ["S", "M", "L"]  ,// ✅ 尺寸放在這裡
        features: [
            "材質耐洗、快乾，清潔方便",
            "貼合身形，活動自在不受限",
            "有效阻擋冷風，不厚重不悶熱"
        ]
    },

    "dog-clothes-3": {
        name: "狗狗立領衝鋒衣",
        price: "880",
        img: "img/03-10.png",
        desc: "立領防風設計，外出更保暖有型",
        sizes: ["S", "M", "L"]  ,// ✅ 尺寸放在這裡
        features: [
            "適合散步、出遊與日常穿搭",
            "穿著舒適不悶熱，活動自在",
            "有效阻擋冷風，保護頸部不受寒"
        ],
        discount: 0.8,
        discountEnd: "2026-01-09T23:59:59"
    },

    "dog-clothes-4": {
        name: "萌獸刷毛背心恐龍裝",
        price: "880",
        img: "img/03-11.png",
        desc: "秋冬季狗狗鋪棉背心",
        sizes: ["S", "M", "L"]  ,// ✅ 尺寸放在這裡
        features: [
            "不粘毛魔鬼氈設計 舒適貼合",
            "韓風繽紛可愛色調 三色可選",
            "柔軟溫暖 輕量舒適狗狗衣服"
        ]
    },

    "dog-snack-1": {
        name: "德國 Vegdog｜夾心脆脆",
        price: "270",
        weight: "115g",
        img: "img/02-7.png",
        desc: "外層酥脆、內芯綿密",
        features: [
            "超過14%蛋白",
            "純素、低敏、不含人工香料與色素",
            "含牛磺酸（2000 mg/kg），有助心臟健康"
        ]
    },

    "dog-snack-2": {
        name: "美國 HALO｜低敏舒膚 - 香蕉花生酥餅",
        price: "225",
        weight: "226g",
        img: "img/02-8.png",
        desc: "結合真實香蕉與花生，帶來香甜可口的天然風味",
        features: [
            "花生濃郁香氣，提升嗜口性",
            "低敏配方，不易造成身體負擔",
            "酥脆口感，適合作為散步與訓練獎勵"
        ]
    },

    "dog-snack-3": {
        name: "美國 HALO｜低敏舒膚 - 南瓜花生酥餅",
        price: "225",
        weight: "226g",
        img: "img/02-12.png",
        desc: "一口原肉，滿足貓咪本能美味",
        features: [
            "低敏配方，不刺激體質",
            "南瓜富含膳食纖維，清爽好消化",
            "小塊酥餅，適合訓練與日常獎勵"
        ]
    },

    "dog-snack-4": {
        name: "德國 Vegdog｜天然無添加植物NEW肉條",
        price: "220",
        weight: "226g",
        img: "img/02-13.png",
        desc: "純肉慢烘，吃得到真正的營養",
        features: [
            "獸醫團隊合作研發，營養安心",
            "不含人工香料及其他化學成分",
            "香味來自山毛櫸煙燻，純天然無添加"
    ]
    },
    "dog-snack-5": {
        name: "【 Lily's Kitchen 莉莉廚房 】熱帶芒果乾",
        price: "220",
        weight: "70g",
        img: "img/02-17.png",
        desc: "純植物無肉配方，營養滿點",
        features: [
            "不含穀物與肉類，健康無負擔",
            "富含芒果、地瓜、藜麥，活力滿滿",
            "經獸醫與營養師認可，讓狗狗享受植物點心"
        ],
            discount: 0.8,
            discountEnd: "2026-01-09T23:59:59"
    },

    //換貓咪
    "cat-food-1": {
        name: "皇家貓飼料",
        price: "800",
        weight: "4kg",
        img: "img/03-1.png",
        desc: "支持健康體態與活力，適合各階段成貓食用",
        features: [
            "添加益生元，幫助腸道菌叢平衡",
            "含優質蛋白與必需維生素，維持健康體態",
            "Omega-3 與 Omega-6 脂肪酸，維持毛色亮麗"
        ]
    },

    "cat-food-2": {
        name: "85%鮮雞肉無穀全貓糧",
        price: "790",
        weight: "15kg",
        img: "img/03-2.png",
        desc: "低敏易消化，提供全貓種每日所需營養",
        features: [
            "呵護腸胃，減少過敏與消化不適",
            "85%鮮雞肉，蛋白質豐富，支持肌肉與體能發展",
            "添加維生素、礦物質與Omega脂肪酸，維持毛髮亮麗與整體健康"
        ]
    },

    "cat-food-3": {
        name: "科克蘭 雞肉&米配方乾貓糧",
        price: "900",
        weight: "11.34kg",
        img: "img/03-3.png",
        desc: "採用優質雞肉與米，低敏易消化",
        features: [
            "天然纖維照顧腸胃健康",
            "新鮮雞肉提供蛋白質來源",
            "添加礦物質提供理想成分"
        ]
    },

    "cat-food-4": {
        name: "無穀低敏 雞肉藍莓全貓配方",
        price: "1950",
        weight: "4.54kg",
        img: "img/03-4.png",
        desc: "專為成犬設計，營養均衡，健康美味。",
        features: [
            "單一蛋白來源，低敏安全",
            "全粒藍莓添加，幫助維持泌尿道健康",
            "單一碳水化合物搭配優質蛋白，適合全貓種"
        ],
        discount: 0.8,
        discountEnd: "2026-01-09T23:59:59"
    },

    "cat-food-5": {
        name: "希爾思 Hill's 成貓 鮭魚糙米全燕麥",
        price: "1500",
        weight: "1058kg",
        img: "img/03-5.png",
        desc: "鮭魚糙米與全燕麥配方，促進消化健康",
        features: [
            "高吸收率蛋白質，支持肌肉健康",
            "糙米與全燕麥富含膳食纖維，幫助腸道健康",
            "添加維生素與礦物質，維持理想體態與活力"
        ]
    },

    "cat-toy-1": {
        name: "貓咪彈球玩具",
        price: "150",
        img: "img/02-2.jpg",
        desc: "速度靈動，是貓咪的焦點王",
        features: [
                "讓貓為之瘋狂的羽毛",
                "一組三入 盡享狩獵的樂趣",
                "喚醒刻在基因裡的捕獵記憶"
    ]
    },

    "cat-toy-2": {
        name: "Petcare｜可伸縮光纖互動逗貓棒",
        price: "800",
        img: "img/03-6.png",
        desc: "讓貓咪自主追逐光點，增添玩樂趣味",
        features: [
                "光纖末端產生光點，吸引貓咪追逐",
                "太陽能 + Type-C 充電：環保又方便",
                "可調整長度，滿足不同遊戲方式與距離需求"
        ],
        discount: 0.8,
        discountEnd: "2026-01-09T23:59:59"
    },


    "cat-toy-3": {
        name: "貓壹 奇幻隧道 天空藍",
        price: "540",
        img: "img/03-7.png",
        desc: "快速衝刺、隱身埋伏，每天玩不膩",
        features: [
                "內外不同圖案，更耐抓，增加耐用度",
                "不傷爪、特殊塗層增強韌度，不易掉色",
                "全新天空藍配色與腳印點綴，拍照超上相"
        ]
    },

    "cat-toy-4": {
        name: "icat 魚骨頭咬咬玩具",
        price: "200",
        img: "img/03-8.png",
        desc: "魚骨頭造型咬咬玩具，耐抓耐咬",
        features: [
                "魚骨頭造型吸引貓咪玩耍",
                "耐咬材質：安全耐用，適合咬咬與抓抓",
                "促進互動：增加主人與貓咪之間的互動樂趣"
    ]
    },

    "cat-toy-5": {
        name: "iCAT 橄欖球毛氈玩具",
        price: "120",
        img: "img/03-9.png",
        desc: "貓咪可咬咬、踢踢，陪伴毛孩安全玩耍",
        features: [
                "刺激貓咪玩耍興趣，促進活動量",
                "大小適中，方便貓咪抓、踢、咬",
                "純羊毛氈製作，不含木天蓼或貓草"
    ]
    },

    "cat-snack-1": {
        name: "手撕貓零食化毛大師（膳食纖維)",
        price: "160",
        weight: "50g",
        img: "img/04-6.png",
        desc: "純肉慢烘，吃得到真正的營養",
        features: [
            "不含化學添加物、色素與防腐劑",
            "20 小時低溫烘烤，完整保留營養",
            "100% 純肉機能零食，搭配多種營養添加"
        ]
    },

    "cat-snack-2": {
        name: "貓用羊奶凍乾零食｜雞肉",
        price: "400",
        weight: "57g",
        img: "img/04-7.png",
        desc: "凍乾鎖鮮，營養一口到位",
        features: [
            "完整封存天然風味與營養",
            "高蛋白營養，口感鬆脆好吸收",
            "幫助維持腸道健康、提升消化力"
        ],
        discount: 0.8,
        discountEnd: "2026-01-09T23:59:59"
    },

    "cat-snack-3": {
        name: "手撕貓零食化毛大師（膳食纖維)",
        price: "330",
        weight: "30g",
        img: "img/04-8.png",
        desc: "一口原肉，滿足貓咪本能美味",
        features: [
            "100%原肉凍乾｜無添加防腐劑",
            "冷凍乾燥技術，保留完整營養",
            "獨家口味，符合犬貓獵食本能"
        ]
    },

    "cat-snack-4": {
        name: "【等等益生菌凍乾貓零食】紓壓大師（雞肉）",
        price: "160",
        weight: "30g",
        img: "img/04-6.png",
        desc: "純肉慢烘，吃得到真正的營養",
        features: [
            "讓毛孩更安心",
            "高蛋白補充，守護腸道健康",
            "幫助穩定情緒，減少緊迫感"
        ]
    },

    "cat-clothes-1": {
        name: "毛茸茸麋鹿貓披風貓斗篷",
        price: "750",
        img: "img/04-1.png",
        desc: "採用柔軟保暖面料，貼合貓咪身型",
        sizes: ["S", "M", "L"]  ,// ✅ 尺寸放在這裡
        features: [
            "優質雲朵絨與搖粒絨，舒適加倍保暖",
            "貼合自如：符合貓咪身型，不束縛活動",
            "連帽設計＋魔術貼，易穿脫且不易粘毛"
        ]
    },

    "cat-clothes-2": {
        name: "櫻桃針織保暖寵物背心",
        price: "700",
        img: "img/04-2.png",
        desc: "秋冬保暖貓背心，柔軟舒適",
        sizes: ["S", "M", "L"]  ,// ✅ 尺寸放在這裡
        features: [
            "包芯紗面料，舒適又保暖",
            "V領＋彈力收邊，活動自如不束縛",
            "菱形刺繡與櫻桃裝飾，荷葉袖點綴可愛感"
        ]
    },

    "cat-clothes-3": {
        name: "窩夫保暖寵物背心",
        price: "650",
        img: "img/04-3.png",
        desc: "給貓咪的秋冬保暖背心，輕盈柔軟，透氣保暖",
        sizes: ["S", "M", "L"]  ,// ✅ 尺寸放在這裡
        features: [
            "弧形下擺鎖住溫暖，抵禦寒冷",
            "純棉面料輕盈透氣，保暖又舒適",
            "窩夫格紋：空氣層結構提供出色隔熱性能"
        ],
        discount: 0.8,
        discountEnd: "2026-01-09T23:59:59"
    },

    "cat-clothes-4": {
        name: "可愛小熊保暖寵物背心 *絕版款*",
        price: "600",
        img: "img/04-4.png",
        desc: "秋冬保暖貓背心，柔軟舒適，活動自如又可愛",
        sizes: ["S", "M", "L"]  ,// ✅ 尺寸放在這裡
        features: [
            "超柔軟兔絨包芯紗，保暖輕盈",
            "無袖套頭設計，貼合身型不束縛",
            "背部可愛小熊與立體蝴蝶結裝飾"
        ]
    },

    "cat-clothes-5": {
        name: "復古愛心保暖寵物背心",
        price: "650",
        img: "img/04-5.png",
        desc: "柔軟溫暖的秋冬貓背心，舒適貼身，讓毛孩自在活動",
        sizes: ["S", "M", "L"]  ,// ✅ 尺寸放在這裡
        features: [
            "花邊小高領，防風保暖",
            "超柔軟兔絨包芯紗，保暖舒適",
            "套頭設計，領口袖口下擺彈力收邊，穿脫方便"
        ]
    },
    }; 
